#ifndef _ALLCODEINR_H
#define _ALLCODEINR_H
#include "keyboard.h"
#include "MyCode.h"

// 电池电压的设置
#define BAT_VOL_PIN ADC_P15
// 定义bb机
#define BEEP P67
// 停车触发
#define HRTRIG P26

/*******************************************变量定义声明*********************************************************/
float base_speed = 0;

/****************************系统界面********************************/
int display_switch = 1;  // 显示屏开关trace_flag
float multiple_time = 1; // 调整位数
extern uint32 isr_count_flag;   // 计数显示时间
uint32 isr_counter_start = 0;   // 计数显示时间
int sys_display[3]= {0};     // 显示界面0主菜单 界面1PID1参数 界面2PID2参数  界面3速度显示模块  界面4模式选择模块 界面5无刷电机模块进 界面6电磁ADC模块进入 界面7电池模块 界面8的PID3
int8 cursor = 0;         // 光标位置
/***************************************************************************************/

/****************************电压检测********************************/
uint16 ad_result = 0;       // 引脚电压
uint16 battery_voltage = 0; // 电池电压
uint32 temp;
/***************************************************************************************/

/********************************无线模式变量**********/
uint16 key = 0;
uint16 date_len = 0;
uint16 key_mode = 0;
/***************************************************************************************************/

#endif